tutorials/interFoam4PCMFoam/waterAndPCM/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phase1//Oleic acid
{
    transportModel	Newtonian;
    nu			nu [ 0 2 -1 0 0 0 0 ] 3.53e-06;
    rho			rho [ 1 -3 0 0 0 0 0 ] 850;
    Cp			Cp [ 0 2 -2 -1 0 0 0 ] 2150;
    kappa		kappa [ 1 1 -3 -1 0 0 0 ] 0.24;
    mu			mu [ 1 -1 -1 0 0 0 0 ] 3e-3;
    beta		beta [ 0 0 0 -1 0 0 0 ] 6.8e-4;
    Prt			Prt [ 0 0 0 0 0 0 0 ] 0.85;
}

phase2//Water
{
    transportModel	Newtonian;
    nu			nu [ 0 2 -1 0 0 0 0 ] 1e-06;
    rho			rho [ 1 -3 0 0 0 0 0 ] 998;
    Cp			Cp [ 0 2 -2 -1 0 0 0 ] 4182;
    kappa		kappa [ 1 1 -3 -1 0 0 0 ] 0.6;
    mu			mu [ 1 -1 -1 0 0 0 0 ] 1e-3;
    beta		beta [ 0 0 0 -1 0 0 0 ] 2.1e-4;
    Prt			Prt [ 0 0 0 0 0 0 0 ] 0.85;
}

//sigma			sigma [ 1 0 -2 0 0 0 0 ] 0.07;//Water
sigma			sigma [ 1 0 -2 0 0 0 0 ] 0.032;//Oleic acid
TRef			TRef [ 0 0 0 1 0 0 0 ] 285.0;

// ************************************************************************* //
